[
"- How many attendances are needed to promote [Ex] (event)?",
"- How many attendances are needed to promote the course (typeEvent) [Ex] (event)?",
"- How many attendances are needed to promote the laboratory (typeEvent) [Ex] (event)?",
"- How many attendances are needed to promote the subject [Ex] (event)?",
"- How many attendances are needed to promote the seminar (typeEvent) [Ex] (event)?",
"- How many attendances do I need to have to promote [Ex] (event)?",
"- How many attendances do I need to promote the (typeEvent) [Ex] (event) course?",
"- How many attendances do I need to promote the laboratory (typeEvent) [Ex] (event)?",
"- How many attendances do I need to promote the subject [Ex] (event)?",
"- How many attendances do I need to promote the seminar (typeEvent) [Ex] (event)?",
"- What is the minimum number of attendances to pass [Ex] (event)?",
"- What is the minimum number of attendances to pass the course (typeEvent) [Ex] (event)?",
"- What is the minimum number of attendances to pass the laboratory (typeEvent) [Ex] (event)?",
"- What is the minimum number of attendances to pass the seminar (typeEvent) [Ex] (event)?",
"- What is the minimum number of attendances to pass the subject [Ex] (event)?",
"- How many attendances do I have to pass [Ex] (event)?",
"- How many attendances do I have to pass the course (typeEvent) [Ex] (event)?",
"- How many attendances do I have to pass the laboratory (typeEvent) [Ex] (event)?",
"- How many attendances should I have to pass the seminar (typeEvent) [Ex] (event)?",
"- How many presences should I have to pass the subject [Ex] (event)?",
"- About how many presences should I have to promote the subject [Ex] (event)?",
"- How many attendances should I have to promote [Ex] (event)?",
"- About how many attendances do I have to promote the course (typeEvent) [Ex] (event)?",
"- How many presence do I have to promote the laboratory (typeEvent) [Ex] (event)?",
"- About how many attendances do I have to promote the seminar (typeEvent) [Ex] (event)?",
"- How many attendances are enough to promote [Ex] (event)?",
"- How many attendances are sufficient to promote the subject [Ex] (event)?",
"- How many attendances are enough to promote the course (typeEvent) [Ex] (event)?",
"- How many attendances are sufficient to promote the laboratory (typeEvent) [Ex] (event)?",
"- How many attendances are enough to promote the seminar (typeEvent) [Ex] (event)?",
"- Do you know how many attendances are needed to promote [Ex] (event)?",
"- Do you know how many attendances are needed to promote the subject [Ex] (event)?",
"- Do you know how many attendances are needed to promote the course (typeEvent) [Ex] (event)?",
"- Do you know how many attendances are needed to promote the laboratory (typeEvent) [Ex] (event)?",
"- Do you know how many attendances are needed to promote the seminar (typeEvent) [Ex] (event)?",
"- Do you have any idea how many attendances are needed to promote [Ex] (event)?",
"- Do you have any idea how many attendances are needed to promote the subject [Ex] (event)?",
"- Do you have any idea how many attendances are needed to promote the course (typeEvent) [Ex] (event)?",
"- Do you have any idea how many attendances are needed to promote the laboratory (typeEvent) [Ex] (event)?",
"- Do you have any idea how many attendances are needed to promote the seminar (typeEvent) [Ex] (event)?",
"- Do you know the minimum number of attendances to pass [Ex] (event)?",
"- Do you know the minimum number of attendances to pass the course (typeEvent) [Ex] (event)?",
"- Do you know the minimum number of attendances to pass the laboratory (typeEvent) [Ex] (event)?",
"- Do you know the minimum number of attendances to pass the seminar (typeEvent) [Ex] (event)?",
"- Do you know the minimum number of attendances to pass the subject [Ex] (event)?",
"- Do you have any idea what the minimum number of attendances is to pass [Ex] (event)?",
"- Do you have any idea what the minimum number of attendances is to pass the course (typeEvent) [Ex] (event)?",
"- Do you have any idea what the minimum number of attendances is to pass the laboratory (typeEvent) [Ex] (event)?",
"- Do you have any idea what the minimum number of attendances is to pass the seminar (typeEvent) [Ex] (event)?",
"- Do you have any idea what the minimum number of attendances is to pass the subject [Ex] (event)?"
]