[
"- Care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Știi care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Știi care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Știi care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Știi care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Știi care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Ai idee care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Ai idee care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Ai idee care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Ai idee care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Ai idee care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Poți să îmi spui care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Poți să îmi spui care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Poți să îmi spui care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Poți să îmi spui care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Poți să îmi spui care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Spune-mi și mie care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Spune-mi și mie care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Spune-mi și mie care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Spune-mi și mie care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Spune-mi și mie care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Zi-mi și mie care sunt condițiile minime de promovare pentru [Ex](event)?",
"- Zi-mi și mie care sunt condițiile minime de promovare pentru materia [Ex](event)?",
"- Zi-mi și mie care sunt condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Zi-mi și mie care sunt condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Zi-mi și mie care sunt condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?",
"- Zi-mi și mie condițiile minime de promovare pentru [Ex](event)?",
"- Zi-mi și mie condițiile minime de promovare pentru materia [Ex](event)?",
"- Zi-mi și mie condițiile minime de promovare pentru cursul(typeEvent) [Ex](event)?",
"- Zi-mi și mie condițiile minime de promovare pentru laboratorul(typeEvent) [Ex](event)?",
"- Zi-mi și mie condițiile minime de promovare pentru seminarul(typeEvent) [Ex](event)?"
]