[
 "- What are the minimum promotion conditions for [Ex] (event)?",
 "- What are the minimum promotion conditions for the subject [Ex] (event)?",
 "- What are the minimum promotion requirements for the (typeEvent) [Ex] (event) course?",
 "- What are the minimum promotion conditions for the laboratory (typeEvent) [Ex] (event)?",
 "- What are the minimum promotion conditions for the (typeEvent) [Ex] (event) seminar?",
 "- Do you know the minimum promotion conditions for [Ex] (event)?",
 "- Do you know the minimum promotion conditions for the subject [Ex] (event)?",
 "- Do you know the minimum promotion conditions for the (typeEvent) [Ex] (event) course?",
 "- Do you know the minimum promotion conditions for the laboratory (typeEvent) [Ex] (event)?",
 "- Do you know the minimum promotion conditions for the [typeEvent) [Ex] (event) seminar?",
 "- Do you have any idea what the minimum promotion conditions are for [Ex] (event)?",
 "- Do you have any idea what the minimum promotion conditions for the subject [Ex] (event) are?",
 "- Do you have any idea what the minimum promotion conditions are for the (typeEvent) [Ex] (event) course?",
 "- Do you have any idea what the minimum promotion conditions are for the laboratory (typeEvent) [Ex] (event)?",
 "- Do you have any idea what the minimum promotion conditions are for the seminar (typeEvent) [Ex] (event)?",
 "- Can you tell me what the minimum promotion conditions are for [Ex] (event)?",
 "- Can you tell me the minimum promotion conditions for the subject [Ex] (event)?",
 "- Can you tell me the minimum promotion conditions for the (typeEvent) [Ex] (event) course?",
 "- Can you tell me the minimum promotion conditions for the laboratory (typeEvent) [Ex] (event)?",
 "- Can you tell me the minimum promotion conditions for the seminar (typeEvent) [Ex] (event)?",
 "- Tell me what are the minimum promotion conditions for the subject [Ex] (event)?",
 "- Tell me what are the minimum promotion conditions for the (typeEvent) [Ex] (event) course?",
 "- Tell me what are the minimum promotion conditions for the laboratory (typeEvent) [Ex] (event)?",
 "- Tell me what are the minimum promotion conditions for the (typeEvent) [Ex] (event) seminar?",
 "- Tell me what are the minimum promotion conditions for [Ex] (event)?",
 "- Tell me what are the minimum promotion conditions for the seminar (typeEvent) [Ex] (event)?",
 "- Tell me the minimum promotion conditions for [Ex] (event)?",
 "- Tell me the minimum promotion conditions for the subject [Ex] (event)?",
 "- Tell me the minimum promotion conditions for the (typeEvent) [Ex] (event) course?",
 "- Tell me the minimum promotion conditions for the laboratory (typeEvent) [Ex] (event)?",
 "- Tell me the minimum promotion conditions for the seminar (typeEvent) [Ex] (event)?",
 "- How do I switch to [Ex] (event)?",
 "- Tell me, please, how do I go to [Ex] (event)?",
 "- What score do I need to go to [Ex] (event)?",
 "- What are the minimum scores to pass at [Ex] (event)?",
 "- What is the minimum score per seminar at [Ex] (event)?",
 "- What is the minimum score per course at [Ex] (event)?",
 "- What is the minimum promotion score for [Ex] (event)?",
 "- What is the minimum laboratory score at [Ex] (event)?"
]