[
"- Which teacher has a class in the [Cx](classroom) classroom?",
"- What teacher has a laboratory in the [Cx](classroom) classroom?",
"- Which teacher is teaching in the [Cx](classroom) classroom?",
"- Which teacher holds the laboratory in the [Cx](classroom) classroom?",
"- Which teacher holds the seminar in the [Cx](classroom) classroom?",
"- Who keeps the laboratory in the [Cx](classroom) classroom?",
"- Who holds the seminar in the [Cx](classroom) classroom?",
"- Find my teacher's name in the classroom [Cx](classroom)!",
"- Find me the name of the teacher who keeps the laboratory in the [Cx](classroom) classroom!",
"- Find me the name of the teacher who teaches in the classroom [Cx](classroom) classroom!",
"- Find me the name of the teacher who runs the lab in the [Cx](classroom) classroom!",
"- Find me the name of the teacher who holds the seminar in the [Cx](classroom) classroom!",
"- Please tell me the name of the teacher who has a laboratory in the [Cx](classroom) classroom!",
"- Please tell me the name of the teacher who is teaching in the [Cx](classroom) classroom!",
"- Can you please tell me the name of the teacher who has a laboratory in the [Cx](classroom) classroom?",
"- Can you please tell me the name of the teacher who is teaching in the [Cx](classroom) classroom?",
"- Can you please tell me the name of the teacher who is teaching a laboratory in the [Cx](classroom) classroom?",
"- Who is teaching in the [Cx](classroom) classroom?",
"- Who is teaching the laboratory in the [Cx](classroom) classroom?",
"- Who is teaching the seminar in the [Cx](classroom) classroom?",
"- What is the name of the teacher who is teaching in the [Cx](classroom) classroom?",
"- Who is the teacher who is teaching in the [Cx](classroom) classroom?",
"- Who is teaching in the classroom [Cx](classroom) classroom?",
"- Do you know which teacher is teaching in the [Cx](classroom) classroom?",
"- I would like to know the name of the teacher in the [Cx](classroom) classroom!"
]
